from typing import Any, Dict, List

import pytest


@pytest.fixture
def user_settings() -> Dict[str, List[str]]:
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "GOOGL"]}


@pytest.fixture
def current_date() -> str:
    return "2019-07-14 19:05:01"


@pytest.fixture
def operations() -> List[Dict[str, Any]]:
    return [
        {
            "Дата операции": "16.09.2019 13:27:53",
            "Дата платежа": "17.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -148.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -148.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.48,
            "Категория": "Транспорт",
            "MCC": 4121.0,
            "Описание": "Яндекс Такси",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 148.0,
        },
        {
            "Дата операции": "13.07.2019 00:00:00",
            "Дата платежа": "16.07.2019",
            "Номер карты": "*7195",
            "Статус": "OK",
            "Сумма операции": 189.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 189.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.89,
            "Категория": "Бонусы",
            "MCC": 4121.0,
            "Описание": "Вознаграждение за операции покупок",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 189.0,
        },
        {
            "Дата операции": "02.07.2019 00:00:00",
            "Дата платежа": "16.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": 258.3,
            "Валюта операции": "RUB",
            "Сумма платежа": 258.3,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.58,
            "Категория": "Бонусы",
            "MCC": 4121.0,
            "Описание": "Проценты на остаток по счету",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 258.3,
        },
    ]
